[
  {
    "q": "Первая задача: что это за язык программирования?",
    "p": "https://sun9-21.userapi.com/c857528/v857528415/109b7b/t7Z4FcJVees.jpg",
    "a": [
      "Java",
      "C++",
      "Fortran",
      "BASIC"
    ],
    "r": "C++",
    "c": "C++ считается одним из самых сложных для изучения языков, но оно того стоит, потому что работа на нём очень хорошо оплачивается. На C++ написаны Windows, Linux и другие ОС, драйвера, высокопроизводительные программы для сложных рассчётов, игры, мобильные приложения и многое другое!\nВ то время как в мобильной сфере C++ уже давно опережают другие языки, он определённо держит лидерство например в сфере разработки цифровых устройств. В ИКНТ с этим связано направление Информатика и вычислительная техника."
  },
  {
    "q": "А это что?",
    "p": "https://sun9-31.userapi.com/c857528/v857528376/10ed80/17yl9bD4SJU.jpg",
    "a": [
      "Java",
      "JavaScript",
      "Kotlin",
      "Python"
    ],
    "r": "JavaScript",
    "c": "Это JavaScript, самый популярный язык на сегодняшний день. Он создавался для того, чтобы можно добавить функционал веб-страницам в интернете, а закончилось всё тем, что на нём пишут и серверные, и мобильные, и десктопные приложения. Ну а в вебе он вообще вне конкуренции.\nЗнать JS необходимо, если ты хочешь заниматься веб-разработкой. И из-за своей универсальности знать его стоит любому программисту - ведь на нём одном можно соорудить целую программную систему!\nА как разрабатывать, тестировать и тестировать программные системы, можно научиться на направлениях Программная инженерия, Прикладная информатика, МОиАИС, Информатика и вычислительная техника, Фундаментальная информатика и информационные технологии."
  },
  {
    "q": "Двигаемся дальше. Что за язык?",
    "p": "https://sun9-14.userapi.com/c857528/v857528415/109b61/D9kcmpCMhR8.jpg",
    "a": [
      "Lisp",
      "FORTRAN",
      "SQL",
      "BASIC"
    ],
    "r": "SQL",
    "c": "SQL это не совсем язык программирования, а язык запросов к базе данных, и используется он чуть ли не в каждом серьёзном проекте. Знать его нужно, если вы хотите разрабатывать бекенд (серверная часть приложения), игры, или заниматься анализом данных — очень популярным направлением в наше время!\nВ ИКНТ с науками о данных связаны направления МОиАИС, Информационные системы и технологии, Программная инженерия."
  },
  {
    "q": "Окей, следующая задача. Что за язык?",
    "p": "https://sun9-36.userapi.com/c857528/v857528433/110410/RTSqJvPzitU.jpg",
    "a": [
      "Visual Basic",
      "JavaScript",
      "R",
      "Python"
    ],
    "r": "Python",
    "c": "Это Python, язык, популярность которого резко вскочила после развития сферы искусственного интеллекта и машинного обучения, для работы с которыми язык отлично подошёл.\nУ нас этому обучают на направлениях Прикладная информатика, Программная инженерия, Управление в технических системах, Информатика и вычислительная техника, Фундаментальная информатика."
  },
  {
    "q": "Дальше. Что за язык?",
    "p": "https://sun9-15.userapi.com/c857528/v857528415/109b98/2wCHgYPS-n4.jpg",
    "a": [
      "Java",
      "JavaScript",
      "C++",
      "C#"
    ],
    "r": "Java",
    "c": "Это Java. Этот язык очень многофункционален. На нём можно программировать и высокопроизводительные серверные приложения, и игры для кнопочных мобильников.\nВ древние времена ходили легенды о медлительности программ на Java, но этот миф легко опровергается тем, для чего язык действительно используется. \nЭто в том числе сфера мобильных, распределённых и встраиваемых систем, которые изучаются на направлениях Информатика и вычислительная техника, Прикладная информатика и Управление в технических системах."
  },
  {
    "q": "А это что за крючочки?",
    "p": "https://sun9-6.userapi.com/c858320/v858320698/10c3ab/ZHLPpZYAyzk.jpg",
    "a": [
      "MathLab",
      "Python",
      "R",
      "F"
    ],
    "r": "R",
    "c": "Язык R создан специально для работы с математикой, татистической обработкой данных, графикой и прочими сложными вычислениями. Много применений у него в сфере математической кибернетики. \nС этой областью связаны напралвения Фундаментальная информатика, Математическое обеспечение, Информационные системы и технологии, Системный анализ и управление. "
  },
  {
    "q":  "Тут у нас что такое?",
    "p": "https://sun9-15.userapi.com/c858320/v858320698/10c43b/B_eqmzfaYXk.jpg",
    "a": [
      "До диез",
      "Си бемоль",
      "Microsoft Java",
      "C++++"
    ],
    "r": "До диез",
    "c": "Это C#. Название можно прочитать как Си Шарп или До-диез. Этот язык создан Microsoft как конкурент для Java, и очень на неё похож. На нём тоже можно программировать и под смартфоны, и под нагруженные сервера. И недавно язык нашёл себе применение в Интернете Вещей, активно развивающейся и перспективой концепцией. Это создание умного дома, и даже умного города. \nИнтернет вещей язляется одним из направлений сферы киберфизических систем. И в нашем институте с этой сферой связаны направления Управление в технических системах и Системный анализ и управление. "
  },
  {
    "q": "А это как оказалось в квизе по языкам программирования?",
    "p": "https://sun9-69.userapi.com/c858320/v858320698/10c496/vjG7Y1UFVLU.jpg",
    "a": [
      "Автор головой стукнулся",
      "Похоже на современное искусство",
      "Это Visual Basic",
      "Это UML-диаграмма"
    ],
    "r": "Это UML-диаграмма",
    "c": "UML-диаграмма. Такого рода картинки создаются по достаточно строгим правилам для анализа возможных действий пользователей программы, с целью описания поведения системы и проверки её работоспособности через тестирование. А занимаются тестированием специалисты в сфере управления качеством. \nС этой сферой связвны направления Управление качеством и Инноватика. "
  }
]