[
  {
    "q": "Первая задача: что это за язык программирования?",
    "p": "https://sun9-21.userapi.com/c857528/v857528415/109b7b/t7Z4FcJVees.jpg",
    "a": [
      "Java",
      "C++",
      "Fortran",
      "BASIC"
    ],
    "r": "C++",
    "c": "C++ считается одним из самых сложных для изучения языков, но оно того стоит, потому что работа на нём очень хорошо оплачивается. На C++ написаны Windows, Linux и другие ОС, драйвера, высокопроизводительные программы для сложных рассчётов, игры, мобильные приложения и многое другое!\n "
  },
  {
    "q": "А это что?",
    "p": "https://sun9-31.userapi.com/c857528/v857528376/10ed80/17yl9bD4SJU.jpg",
    "a": [
      "Java",
      "JavaScript",
      "Kotlin",
      "Python"
    ],
    "r": "JavaScript",
    "c": "Это JavaScript, самый популярный язык на сегодняшний день. Он создавался для того, чтобы можно добавить функционал веб-страницам в интернете, а закончилось всё тем, что на нём пишут и серверные, и мобильные, и десктопные приложения. Ну а в вебе он вообще вне конкуренции.\nЗнать JS необходимо, если ты хочешь заниматься веб-разработкой. И из-за своей универсальности знать его стоит любому программисту! "
  },
  {
    "q": "Двигаемся дальше. Что за язык?",
    "p": "https://sun9-14.userapi.com/c857528/v857528415/109b61/D9kcmpCMhR8.jpg",
    "a": [
      "Lisp",
      "FORTRAN",
      "SQL",
      "BASIC"
    ],
    "r": "SQL",
    "c": "SQL это не совсем язык программирования, а язык запросов к базе данных, и используется он чуть ли не в каждом серьёзном проекте. Знать его нужно, если вы хотите разрабатывать бекенд (серверная часть приложения), игры, или заниматься анализом данных — очень популярным направлением в наше время!"
  },
  {
    "q": "Окей, следующая задача. Что за язык?",
    "p": "https://sun9-36.userapi.com/c857528/v857528433/110410/RTSqJvPzitU.jpg",
    "a": [
      "Visual Basic",
      "JavaScript",
      "R",
      "Python"
    ],
    "r": "Python",
    "c": "Это Python, язык, популярность которого резко вскочила после развития сферы наук о данных — Big Data & Data Science, для работы с которыми язык отлично подошёл.\nВ ИКНТ с науками о данных связаны направления МОиАИС, Информационные системы и технологии, Программная инженерия."
  },
  {
    "q": "Дальше. Что за язык?",
    "p": "https://sun9-15.userapi.com/c857528/v857528415/109b98/2wCHgYPS-n4.jpg",
    "a": [
      "Java",
      "JavaScript",
      "C++",
      "C#"
    ],
    "r": "Java",
    "c": "Это Java. Этот язык очень многофункционален. На нём можно программировать и высокопроизводительные серверные приложения, и игры для кнопочных мобильников.\nВ древние времена ходили легенды о медлительности программ на Java, но этот миф легко опровергается тем, для чего язык действительно используется. \nЭто в том числе сфера мобильных, распределённых и встраиваемых систем, которые изучаются на направлениях Информатика и вычислительная техника, Прикладная информатика и Управление в технических системах."
  }
]